Revit 2027 API
IEntryPoint.Initialize Method
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Initialize(
	Object obj,
	string addinFolder
)
Sub Initialize (
	obj As Object,
	addinFolder As String
)
void Initialize(
	Object^ obj,
	String^ addinFolder
)
abstract Initialize :
        obj : Object *
        addinFolder : string -> unit
Parameters
obj Object
addinFolder String
See Also
Reference
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace